Revit 2027 API
FileOpenDialog.ShowPreview Property
 Identifies if the dialog should include a region showing a preview of the selected file.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ShowPreview { get; set; }
Public Property ShowPreview As Boolean
	Get
	Set
public:
property bool ShowPreview {
	bool get ();
	void set (bool value);
}
member ShowPreview : bool with get, set
Property Value
Boolean
 The default value is false, to not show the preview area in the dialog. If set to true, note that Revit may not be able to show a preview of all possible file types.
See Also
Reference
FileOpenDialog Class
Autodesk.Revit.UI Namespace